# RbsProjectReporttypeParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsProjectReporttypeParam Property
ParameterTypeId Class See Also
---
"Report Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsProjectReporttypeParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsProjectReporttypeParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsProjectReporttypeParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace